Project/Toir/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/торо_СписокОбъектовРегламентногоМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СписокОбъектовРегламентногоМероприятия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИндивидуальноеОбслуживаниеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПредшествующиеРегламентныеМероприятия/торо_ПредшествующиеРегламентныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПредшествующиеРегламентныеМероприятия</name>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредшествующийВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВыходныеДокументы/торо_ВыходныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыходныеДокументы</name>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыходнойДокумент</name>
    <type>
      <types>EnumRef.торо_ВидыВыходныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗначенияКоэффициентовРемонтныхОсобенностей/торо_ЗначенияКоэффициентовРемонтныхОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКоэффициентовРемонтныхОсобенностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеКоэффициента</name>
    <type>
      <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСтроительства</name>
  <enumValues>
    <name>Подрядный</name>
    <comment>С привлечением подрядных организаций</comment>
  </enumValues>
  <enumValues>
    <name>Хозспособ</name>
    <comment>Строительство собственными силами</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот/торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</name>
  <enumValues>
    <name>ИспользоватьДатуВводаВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьДатуПланированияВКачествеДатыОтсчета</name>
  </enumValues>
  <enumValues>
    <name>НеИспользоватьДатуВводаВЭксплуатацию</name>
    <comment>Последний ремонт или ничего</comment>
  </enumValues>
  <enumValues>
    <name>ПоПоследнемуРемонтуИлиДатеПланирования</name>
    <comment>Последний ремонт или дата планирования</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем ПараметрыТекущейСтроки;
// Переменные необходимые для избавления от модальности
&НаКлиенте
Перем РегламентноеМероприятиеДобавляется;
&НаКлиенте
Перем СписокОбъектовДобавляется;
&НаКлиенте
Перем ВыходныеДокументыДобавляется; 

&НаКлиенте
Перем СтруктураДанныхДоРедактирования;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ПравоРедактирования = ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные());
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбъектФормы = РеквизитФормыВЗначение("Объект");
		СсылкаНаЭлемент = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ОбъектФормы);
		ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособПланирования,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ГрафикРемонтныхРабот,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособВыполнения,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособУчетаДатыОтсчета,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.НеУчаствуетВПланировании,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.НеУчитыватьПродолжительность,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.Продолжительность,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособРасчетаПродолжительности
		|ИЗ
		|	РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
		|ГДЕ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов = &СписокОбъектов";

	Запрос.УстановитьПараметр("СписокОбъектов", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент));
	РезультатЗапроса = Запрос.Выполнить();

	Таб = РезультатЗапроса.Выгрузить();

	РегламентныеМероприятия.Загрузить(Таб);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПредшествующиеРегламентныеМероприятия.ВидМероприятия,
		|	торо_ПредшествующиеРегламентныеМероприятия.СписокОбъектов,
		|	торо_ПредшествующиеРегламентныеМероприятия.ПредшествующийВидМероприятия
		|ИЗ
		|	РегистрСведений.торо_ПредшествующиеРегламентныеМероприятия КАК торо_ПредшествующиеРегламентныеМероприятия
		|ГДЕ
		|	торо_ПредшествующиеРегламентныеМероприятия.СписокОбъектов = &СписокОбъектов";

	Запрос.УстановитьПараметр("СписокОбъектов", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент));

	РезультатЗапроса = Запрос.Выполнить();

	ТЗ = РезультатЗапроса.Выгрузить();

	ПредшествующиеМероприятия.Загрузить(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВыходныеДокументы.СписокОбъектов,
		|	торо_ВыходныеДокументы.ВидМероприятия,
		|	торо_ВыходныеДокументы.ВыходнойДокумент
		|ИЗ
		|	РегистрСведений.торо_ВыходныеДокументы КАК торо_ВыходныеДокументы
		|ГДЕ
		|	торо_ВыходныеДокументы.СписокОбъектов = &СписокОбъектов";

	Запрос.УстановитьПараметр("СписокОбъектов", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент));

	РезультатЗапроса = Запрос.Выполнить();

	ТабЗнач = РезультатЗапроса.Выгрузить();
	ВыходныеДокументы.Загрузить(ТабЗнач);
	
	НаборЗаписей = РегистрыСведений.торо_МаршрутыРегламентныхМероприятий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СписокОбъектов.Установить(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент));
	НаборЗаписей.Прочитать();
	СписокОбъектов.Загрузить(НаборЗаписей.Выгрузить());
	СписокОбъектов.Сортировать("НомерПоПорядку Возр");
		
	КоличествоОР = СписокОбъектов.Количество();

	МодифицированностьВыхДок = Ложь;
	МодифицированностьПредшРемонтов = Ложь;
	МодифицированностьРегМер = Ложь;
	
	фоИспользоватьКоэффициентыРемОсобенностей = ПолучитьФункциональнуюОпцию("торо_ИспользоватьКоэффициентыРемОсобенностей");
	
	Элементы.ИспользоватьКоэффициентыРемонтныхОсобенностей.Видимость = фоИспользоватьКоэффициентыРемОсобенностей;
	
	
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства
	
	флИндОбслужНачальный = Объект.ИндивидуальноеОбслуживаниеОР;
	
	УстановитьПараметрыЗапросовНаСервере();
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		КопируемыйОбъект = Параметры.ЗначениеКопирования;
		
		НаборЗаписей = РегистрыСведений.торо_РегламентныеМероприятияИСпискиОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СписокОбъектов.Установить(КопируемыйОбъект);
		НаборЗаписей.Прочитать();
		ТЗ = НаборЗаписей.Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			РегламентныеМероприятия.Загрузить(ТЗ);
			МодифицированностьРегМер = Истина;	
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.торо_ПредшествующиеРегламентныеМероприятия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СписокОбъектов.Установить(КопируемыйОбъект);
		НаборЗаписей.Прочитать();
		ТЗ = НаборЗаписей.Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			ПредшествующиеМероприятия.Загрузить(ТЗ);
			МодифицированностьПредшРемонтов = Истина;	
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.торо_ВыходныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СписокОбъектов.Установить(КопируемыйОбъект);
		НаборЗаписей.Прочитать();
		ТЗ = НаборЗаписей.Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			ВыходныеДокументы.Загрузить(ТЗ);
			МодифицированностьВыхДок = Истина;	
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.торо_МаршрутыРегламентныхМероприятий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СписокОбъектов.Установить(КопируемыйОбъект);
		НаборЗаписей.Прочитать();
		ТЗ = НаборЗаписей.Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			СписокОбъектов.Загрузить(ТЗ);
			МодифицированностьВыхДок = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [23.10.2019]
	дс_УстановитьЗаголовкиЭлементов();
	// << [Деснол] [Ушаков А.Д.] [23.10.2019] 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если РегламентныеМероприятия.Количество() > 0 Тогда
		
		Элементы.РегламентныеМероприятия.ТекущаяСтрока = РегламентныеМероприятия[0];
		
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить("РегламентныеМероприятия");
	
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если РегламентныеМероприятия.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("es='La tabla ""las medidas De reglamento"" no es rellenada.';ru='Таблица ""Регламентные мероприятия"" не заполнена.';en='The table ""Scheduled activities"" is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;
	
	Если СписокОбъектов.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("es='La tabla ""la Lista de los objetos"" no es rellenada.';ru='Таблица ""Список объектов"" не заполнена.';en='The table ""List of objects"" is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;
	
	Для каждого Мероприятие Из РегламентныеМероприятия Цикл 
		СтрокиПредМероприятий = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура("ВидМероприятия", Мероприятие.ВидМероприятия));
		
		Если СтрокиПредМероприятий.Количество() = 0 Тогда
			ШаблонСообщения = НСтр("es='Para la medida de reglamento ""%1"" no son rellenadas las medidas que preceden. ¡La anotación era anulada!';ru='Для регламентного мероприятия ""%1"" не заполнены предшествующие мероприятия. Запись была отменена!';en='For routine activity ""%1,"" the previous activities are not completed. Recording has been canceled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Мероприятие.ВидМероприятия);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СообщитьОВозможномИзмененииПродолжительностиРемонта();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
	Если НЕ Объект.ЭтоГруппа Тогда
		
		СтруктураОбязательныхПолейНЗ = Новый Структура("ВидМероприятия, НормативныйРемонт, СпособПланирования, ГрафикРемонтныхРабот, СпособВыполнения",
														"Вид мероприятия", "Нормативный ремонт", "Способ планирования", "График ремонтных работ", "Способ выполнения");
		
		ПроверитьЗаполнениеОбязательныхПолейНаборовЗаписей(СтруктураОбязательныхПолейНЗ,
		"РегламентныеМероприятия",
		Отказ,
		НСтр("es='La comprobación del relleno de la tabla de las medidas de reglamento...';ru='Проверка заполнения таблицы регламентных мероприятий...';en='Checking the completion of the routine maintenance table ...'"));
		
		
		СтруктураОбязательныхПолейВД = Новый Структура("ВыходнойДокумент", "Выходной документ");
		
		ПроверитьЗаполнениеОбязательныхПолейНаборовЗаписей(СтруктураОбязательныхПолейВД,
		"ВыходныеДокументы",
		Отказ,
		НСтр("es='La comprobación del relleno de la tabla de los documentos de salida...';ru='Проверка заполнения таблицы выходных документов...';en='Checking that the output table is populated ...'"));
	КонецЕсли;
		
	Если НЕ Отказ Тогда
		флИндОбслужНачальный = ТекущийОбъект.ИндивидуальноеОбслуживаниеОР;
		флСписокОбъектовМодифицированность = Ложь;
		СписокМодифицированныхМероприятий.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СообщитьОВозможномИзмененииПродолжительностиРемонта();
	флСписокОбъектовМодифицированность = Ложь;
	СписокМодифицированныхМероприятий.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Ссылка = ?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка), ТекущийОбъект.Ссылка, СсылкаНаЭлемент);
	Если МодифицированностьРегМер Тогда
		
		Для каждого СтрТаб Из РегламентныеМероприятия Цикл
			ШаблонСообщения = НСтр("es='No consiguió anotar las medidas de reglamento: no es rellenado el campo ""%1"" en la línea el número %2';ru='Не удалось записать регламентные мероприятия: не заполнено поле ""%1"" в строке номер %2';en='Failed to record scheduled activities: field ""%1"" in line number%2 is not filled'");
			НомерСтроки = Строка(СтрТаб.ПолучитьИдентификатор()+1);
			
			Если НЕ ЗначениеЗаполнено(СтрТаб.ВидМероприятия) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, "Вид мероприятия", НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТаб.НормативныйРемонт) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, "Нормативный ремонт", НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТаб.СпособПланирования) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, "Вид планирования", НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТаб.ГрафикРемонтныхРабот) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, "График ремонтных работ", НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТаб.СпособВыполнения) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, "Способ выполнения", НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Отказ Тогда
			Попытка
				
				Для Каждого СтрокаТЧ Из РегламентныеМероприятия Цикл
					
					СтрокаТЧ.СписокОбъектов = Ссылка;
					
				КонецЦикла;
				
				ТаблицаЗначенийРегламентныеМероприятия = РегламентныеМероприятия.Выгрузить();
				МассивСтрок = ТаблицаЗначенийРегламентныеМероприятия.НайтиСтроки(Новый Структура("СписокОбъектов", Ссылка));
				ТаблицаБуфер = ТаблицаЗначенийРегламентныеМероприятия.Скопировать(МассивСтрок);
				
				НаборРегламентныхМероприятий = РегистрыСведений.торо_РегламентныеМероприятияИСпискиОбъектов.СоздатьНаборЗаписей();
				НаборРегламентныхМероприятий.Отбор.СписокОбъектов.Установить(Ссылка);
				НаборРегламентныхМероприятий.Загрузить(ТаблицаБуфер);
				НаборРегламентныхМероприятий.Записать();
				
				МодифицированностьРегМер = Ложь;
			Исключение
				
				ТекстСообщения = НСтр("es='No consiguió anotar las medidas de reglamento para la lista de los objetos: ';ru='Не удалось записать регламентные мероприятия для списка объектов: ';en='Failed to record scheduled activities for the list of objects: '") + ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
				Возврат;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МодифицированностьПредшРемонтов Тогда 
		
		Попытка
			
			Для Каждого СтрокаТЧ Из ПредшествующиеМероприятия Цикл
					
				СтрокаТЧ.СписокОбъектов = Ссылка;
					
			КонецЦикла;
			
			ТаблицаЗначенийВидыРемонтныхРаботДляОтсчета = ПредшествующиеМероприятия.Выгрузить();
			МассивСтрок = ТаблицаЗначенийВидыРемонтныхРаботДляОтсчета.НайтиСтроки(Новый Структура("СписокОбъектов", Ссылка));
			ТаблицаБуфер = ТаблицаЗначенийВидыРемонтныхРаботДляОтсчета.Скопировать(МассивСтрок);
			
			ТаблицаПроверки = РегламентныеМероприятия.Выгрузить();
			
			Сч = ТаблицаБуфер.Количество() - 1;
			Пока Сч >= 0 И ТаблицаБуфер.Количество() > 0 Цикл
				
				МассивПоиска = ТаблицаПроверки.НайтиСтроки(
				Новый Структура("СписокОбъектов, ВидМероприятия", Ссылка, ТаблицаБуфер[Сч].ВидМероприятия));
				
				Если МассивПоиска.Количество() = 0 Тогда
					
					ТаблицаБуфер.Удалить(ТаблицаБуфер[Сч]);
					
				КонецЕсли; 
				
				Сч = Сч - 1;
				
			КонецЦикла;
			
			НаборЗаписей = РегистрыСведений.торо_ПредшествующиеРегламентныеМероприятия.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СписокОбъектов.Установить(Ссылка);
			НаборЗаписей.Загрузить(ТаблицаБуфер);
			НаборЗаписей.Записать();
			
			МодифицированностьПредшРемонтов = Ложь;
			
		Исключение
			
			ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden de la lista de los objetos: ';ru='Не удалось записать предшествующие ремонты списка объектов: ';en='Failed to record previous repairs to the list of objects: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьВыхДок Тогда 
		
		Попытка
			
			Для Каждого СтрокаТЧ Из ВыходныеДокументы Цикл
					
				СтрокаТЧ.СписокОбъектов = Ссылка;
					
			КонецЦикла;
			
			ТаблицаЗначенийВыходныеДокументы = ВыходныеДокументы.Выгрузить();
			МассивСтрок = ТаблицаЗначенийВыходныеДокументы.НайтиСтроки(Новый Структура("СписокОбъектов", Ссылка));
			ТаблицаБуфер = ТаблицаЗначенийВыходныеДокументы.Скопировать(МассивСтрок);
			
			ТаблицаПроверки = ВыходныеДокументы.Выгрузить();
			
			Сч = ТаблицаБуфер.Количество() - 1;
			Пока Сч >= 0 И ТаблицаБуфер.Количество() > 0 Цикл
				
				МассивПоиска = ТаблицаПроверки.НайтиСтроки(
				Новый Структура("СписокОбъектов, ВидМероприятия", Ссылка, ТаблицаБуфер[Сч].ВидМероприятия));
				
				Если МассивПоиска.Количество() = 0 Тогда
					
					ТаблицаБуфер.Удалить(ТаблицаБуфер[Сч]);
					
				КонецЕсли; 
				
				Сч = Сч - 1;
				
			КонецЦикла;
			
			НаборЗаписей = РегистрыСведений.торо_ВыходныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СписокОбъектов.Установить(Ссылка);
			НаборЗаписей.Загрузить(ТаблицаБуфер);
			НаборЗаписей.Записать();
			
			МодифицированностьВыхДок = Ложь;
			
		Исключение
			
			ТекстСообщения = НСтр("es='No consiguió anotar los documentos de salida de la lista de los objetos: ';ru='Не удалось записать выходные документы списка объектов: ';en='Failed to write the output of the list of objects: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	
	Попытка
		
		Для Каждого СтрокаТЧ Из СписокОбъектов Цикл
					
			СтрокаТЧ.СписокОбъектов = Ссылка;
					
		КонецЦикла;
		
		ТабСписокОбъектов = СписокОбъектов.Выгрузить();
		МассивСтрок = ТабСписокОбъектов.НайтиСтроки(Новый Структура("СписокОбъектов", Ссылка));
		ТаблицаБуфер = ТабСписокОбъектов.Скопировать(МассивСтрок,"СписокОбъектов, НомерПоПорядку, ОбъектРемонта");
		
		НаборСпискаОбъектов = РегистрыСведений.торо_МаршрутыРегламентныхМероприятий.СоздатьНаборЗаписей();
		НаборСпискаОбъектов.Отбор.СписокОбъектов.Установить(Ссылка);
		НаборСпискаОбъектов.Загрузить(ТаблицаБуфер);
		НаборСпискаОбъектов.Записать();
		
	Исключение
		
		ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden de la lista de los objetos: ';ru='Не удалось записать предшествующие ремонты списка объектов: ';en='Failed to record previous repairs to the list of objects: '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаКоэффициентыРемонтныхОсобенностей Тогда
		ОбновитьКоэффициентыРемонтныхОсобенностей();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредшествующиеМероприятия
&НаКлиенте
Процедура ПредшествующиеМероприятияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Escojan el tipo de la medida!';ru='Выберите вид мероприятия!';en='Choose the type of event!'"), 60);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		
		ТекДанныеНормативов = Элементы.РегламентныеМероприятия.ТекущиеДанные;
		ТекСтрока = Элемент.ТекущиеДанные;
		ТекСтрока.ВидМероприятия = ТекДанныеНормативов.ВидМероприятия;
		ТекСтрока.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ПредшествующиеМероприятия.ТекущиеДанные;
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.ПредшествующийВидМероприятия) Тогда
			ТекстСообщения = НСтр("es='¡Escojan el tipo que precede de la medida!';ru='Выберите предшествующий вид мероприятия!';en='Choose the previous type of event!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		НайденныеСтроки = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура("ВидМероприятия, ПредшествующийВидМероприятия", ТекДанные.ВидМероприятия, ТекДанные.ПредшествующийВидМероприятия));
		Если НайденныеСтроки.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡El tipo escogido que precede de la medida es añadido ya!';ru='Выбранный предшествующий вид мероприятия уже добавлен!';en='Selected previous event type has already been added!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		МодифицированностьПредшРемонтов = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПослеУдаления(Элемент)
	МодифицированностьПредшРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПредшествующийВидМероприятияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокРегМероприятийДляВыбора = новый СписокЗначений;
	
	Для каждого текСтрока из РегламентныеМероприятия цикл
		СписокРегМероприятийДляВыбора.Добавить(текСтрока.ВидМероприятия);
	КонецЦикла;
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеМероприятия", СписокРегМероприятийДляВыбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПредшествующийВидМероприятияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СписокРегМероприятийДляВыбора = новый СписокЗначений;
	
	Для каждого текСтрока из РегламентныеМероприятия цикл
		СписокРегМероприятийДляВыбора.Добавить(текСтрока.ВидМероприятия);
	КонецЦикла;
	
	Параметры.Отбор.Вставить("Ссылка", СписокРегМероприятийДляВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеМероприятияПредшествующийВидМероприятияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СписокРегМероприятийДляВыбора = новый СписокЗначений;
	
	Для каждого текСтрока из РегламентныеМероприятия цикл
		СписокРегМероприятийДляВыбора.Добавить(текСтрока.ВидМероприятия);
	КонецЦикла;
	
	Параметры.Отбор.Вставить("Ссылка", СписокРегМероприятийДляВыбора);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбъектов
&НаКлиенте
Процедура СписокОбъектовПослеУдаления(Элемент)
	КоличествоОР = СписокОбъектов.Количество();
	флСписокОбъектовМодифицированность = Истина;
	МодифицированностьВыхДок = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		КоличествоОР = СписокОбъектов.Количество();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПередУдалением(Элемент, Отказ)
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если Не Отказ Тогда
		ТекНомер = ТекСтрока.НомерПоПорядку;
		Для Каждого Операция Из СписокОбъектов Цикл
			Если Операция.НомерПоПорядку > ТекНомер Тогда
				Операция.НомерПоПорядку = Операция.НомерПоПорядку - 1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		ТекДанные = Элементы.СписокОбъектов.ТекущиеДанные;
		ТекДанные.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
		ТекДанные.НомерПоПорядку = СписокОбъектов.Количество();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		
		
		МассивСтрок = СписокОбъектов.НайтиСтроки(Новый Структура("СписокОбъектов, ОбъектРемонта", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент), Элемент.ТекущиеДанные.ОбъектРемонта));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡No es posible introducir los objetos que repeten de la reparación!';ru='Нельзя вводить повторяющиеся объекты ремонта!';en='Can not enter duplicate repair objects!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если Элемент.ТекущиеДанные.ОбъектРемонта = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка") Тогда
			ТекстСообщения = НСтр("es='¡Es necesario escoger el objeto de la reparación!';ru='Необходимо выбрать объект ремонта!';en='Required to choose the object of repair!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если НоваяСтрока и НЕ Отказ Тогда
			флСписокОбъектовМодифицированность = Истина;
		КонецЕсли;
		
		Если НЕ (Элемент.ТекущиеДанные = Неопределено Или Элементы.СписокОбъектов.ТекущиеДанные = Неопределено) Тогда
			МодифицированностьВыхДок = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовОбъектРемонтаПриИзменении(Элемент)
	флСписокОбъектовМодифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокОбъектовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивВыбранныхЗначений = Новый Массив;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивВыбранныхЗначений = ВыбранноеЗначение;
	Иначе
		МассивВыбранныхЗначений.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	Если МассивВыбранныхЗначений.Количество() = 0 Тогда
		Возврат;  
	КонецЕсли;
	
	Для Каждого СсылкаНаОР ИЗ МассивВыбранныхЗначений Цикл
		МассивСтрок = СписокОбъектов.НайтиСтроки(Новый Структура("ОбъектРемонта",СсылкаНаОР));
		Если МассивСтрок.Количество() = 0 Тогда
			НС = СписокОбъектов.Добавить();
			НС.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
			НС.ОбъектРемонта = СсылкаНаОР;
			НС.НомерПоПорядку = СписокОбъектов.Количество();
		Иначе
			ШаблонСообщения = НСтр("es='¡El objeto de la reparación ""%1"" es ya en la lista!';ru='Объект ремонта ""%1"" уже есть в списке!';en='Repair object ""%1"" is already in the list!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СсылкаНаОР);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		КонецЕсли;
	КонецЦикла;

	КоличествоОР = СписокОбъектов.Количество();
		
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРегламентныеМероприятия
&НаКлиенте
Процедура РегламентныеМероприятияПослеУдаления(Элемент)
	
	МодифицированностьРегМер = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияНормативныйРемонтПриИзменении(Элемент)
	
	ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ВМ = ТекДанные.ВидМероприятия;
		Если СписокМодифицированныхМероприятий.НайтиПоЗначению(ВМ) = Неопределено Тогда
			СписокМодифицированныхМероприятий.Добавить(ВМ);
		КонецЕсли;
	КонецЕсли;
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
		Если Не ЗначениеЗаполнено(ТекДанные.СписокОбъектов) Тогда
			
			ТекДанные.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	
	Если Копирование Тогда 
		ТекДанные.ВидМероприятия = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
	КонецЕсли;
		
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущееМероприятие = Элемент.ТекущиеДанные;
	
	Если Не ОтменаРедактирования И ТекущееМероприятие <> Неопределено И (СтруктураДанныхДоРедактирования.РегламентныеМероприятия = Неопределено ИЛИ ТекущееМероприятие.ВидМероприятия <> СтруктураДанныхДоРедактирования.РегламентныеМероприятия.ВидМероприятия) Тогда
		
		Если ЗначениеЗаполнено(ТекущееМероприятие.ВидМероприятия) Тогда 
			УжеДобавленыеПредшествующие = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура ("ВидМероприятия", ТекущееМероприятие.ВидМероприятия));
			Если УжеДобавленыеПредшествующие.Количество() = 0 Тогда 
				
				ПредшествующееМероприятие = ПредшествующиеМероприятия.Добавить();
				ПредшествующееМероприятие.ВидМероприятия = ТекущееМероприятие.ВидМероприятия;
				ПредшествующееМероприятие.СписокОбъектов = Объект.Ссылка;
				ПредшествующееМероприятие.ПредшествующийВидМероприятия = ТекущееМероприятие.ВидМероприятия;
				
				Элементы.ПредшествующиеМероприятия.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидМероприятия", ТекущееМероприятие.ВидМероприятия);
			КонецЕсли;	
		КонецЕсли; 
		
		ГрафикРемРаб = ПолучитьЗначениеГрафикаРемРабНаСервере();
		
		Если НЕ ГрафикРемРаб = Неопределено Тогда
			Элемент.ТекущиеДанные.ГрафикРемонтныхРабот = ГрафикРемРаб;
		КонецЕсли;
		
		Элемент.ТекущиеДанные.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ");
		
		Элемент.ТекущиеДанные.СпособУчетаДатыОтсчета = ПредопределенноеЗначение("Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуПланированияВКачествеДатыОтсчета");
		
		МодифицированностьРегМер = Истина;
		МодифицированностьПредшРемонтов = Истина;
		
		Если НоваяСтрока Тогда
			
			Элем = СписокМодифицированныхМероприятий.НайтиПоЗначению(ТекущееМероприятие.ВидМероприятия);
			
			Если Элем <> Неопределено Тогда
				СписокМодифицированныхМероприятий.Удалить(Элем);
			КонецЕсли;
			
		КонецЕсли;
		
		РегламентныеМероприятияПриАктивизацииСтроки(Элементы.РегламентныеМероприятия);			
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	Элементы.РегламентныеМероприятияИзменить.Доступность = (НЕ (ТекСтрока<>Неопределено И ТипЗнч(ТекСтрока.СписокОбъектов)=Тип("СправочникСсылка.торо_ТиповыеОР")));
	Элементы.РегламентныеМероприятияУдалить.Доступность = (НЕ (ТекСтрока<>Неопределено И ТипЗнч(ТекСтрока.СписокОбъектов)=Тип("СправочникСсылка.торо_ТиповыеОР")));
		
	Если Не ТекСтрока = Неопределено Тогда 		
		торо_ОбщегоНазначенияКлиент.ЗапомнитьПараметрыТекущейСтроки("СтрРеглМероприятий", Элементы.РегламентныеМероприятия.ТекущаяСтрока, ПараметрыТекущейСтроки);
		
		Элементы.ПредшествующиеМероприятия.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидМероприятия", ТекСтрока.ВидМероприятия);
		
		Элементы.ВыходныеДокументы.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидМероприятия, СписокОбъектов", ТекСтрока.ВидМероприятия, ТекСтрока.СписокОбъектов);
		
	КонецЕсли;
	
	ОбновитьОтображениеПродолжительности();
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПередУдалением(Элемент, Отказ)
	МассивУдаляемыхСтрок = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура("ВидМероприятия, СписокОбъектов", Элементы.РегламентныеМероприятия.ТекущиеДанные.ВидМероприятия, Элементы.РегламентныеМероприятия.ТекущиеДанные.СписокОбъектов));
	Для каждого Элем Из МассивУдаляемыхСтрок Цикл
		ПредшествующиеМероприятия.Удалить(Элем);
	КонецЦикла;
	
	МассивУдаляемыхСтрок = ВыходныеДокументы.НайтиСтроки(Новый Структура("ВидМероприятия, СписокОбъектов", Элементы.РегламентныеМероприятия.ТекущиеДанные.ВидМероприятия, Элементы.РегламентныеМероприятия.ТекущиеДанные.СписокОбъектов));
	Для каждого Элем Из МассивУдаляемыхСтрок Цикл
		ВыходныеДокументы.Удалить(Элем);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	
	Если Не Значениезаполнено(ТекДанные.ВидМероприятия) И НоваяСтрока И НЕ ОтменаРедактирования Тогда
		ТекстСообщения = НСтр("es='¡Escojan el tipo de la medida!';ru='Выберите вид мероприятия!';en='Choose the type of event!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Если НЕ ОтменаРедактирования Тогда 		
				
		Если ТекДанные <> Неопределено Тогда
			
			МассивСтрок = РегламентныеМероприятия.НайтиСтроки(Новый Структура("ВидМероприятия", ТекДанные.ВидМероприятия));
			Если МассивСтрок.Количество() > 1 Тогда
				
				ТекстСообщения = НСтр("es='¡El tipo dado de la medida es añadido ya!';ru='Данный вид мероприятия уже добавлен!';en='This type of event has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;  		
		
		Если Не Отказ И Не НоваяСтрока И СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено
			И СтруктураДанныхДоРедактирования[Элемент.Имя].ВидМероприятия <> ТекДанные.ВидМероприятия Тогда
			СтарыйВМ = СтруктураДанныхДоРедактирования[Элемент.Имя].ВидМероприятия;
			НайденныеСтроки = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура("ВидМероприятия", СтарыйВМ));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ВидМероприятия = ТекДанные.ВидМероприятия;
			КонецЦикла;
			НайденныеСтроки = ПредшествующиеМероприятия.НайтиСтроки(Новый Структура("ПредшествующийВидМероприятия", СтарыйВМ));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ПредшествующийВидМероприятия = ТекДанные.ВидМероприятия;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияНормативныйРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует")), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРемонтныхРаботПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособВыполненияПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаДатыОтсчетаПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьВПланированииПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПриПланированииГрафикРемонтныхРаботПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПродолжительностьПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентыРемонтныхОсобенностейПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеДокументыПослеУдаления(Элемент)
	МодифицированностьВыхДок = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Escojan el tipo de la medida!';ru='Выберите вид мероприятия!';en='Choose the type of event!'"), 60);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияСпособПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования", "СписокРегламентныхМероприятий");	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_СпособыПланированияРемонтныхРабот.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПродолжительностиПриИзменении(Элемент)
	
	Если Элементы.РегламентныеМероприятия.ТекущиеДанные.СпособРасчетаПродолжительности = Неопределено Тогда    		
		Возврат;   		
	ИначеЕсли Элементы.РегламентныеМероприятия.ТекущиеДанные.СпособРасчетаПродолжительности = ПредопределенноеЗначение("Перечисление.торо_СпособыРасчетаПродолжительности.ПоПродолжительностиТехКарт") Тогда 
		
		МассивОР = Новый Массив;
		Для каждого Стр Из СписокОбъектов Цикл
			МассивОР.Добавить(Стр.ОбъектРемонта);
		КонецЦикла; 
		
		Если МассивОР.Количество() = 0 Тогда
			ТекстСообщения = НСтр("es='de la reparación. ¡El cálculo no es cumplido!';ru='Не заполнен список объектов ремонта. Расчет не выполнен!';en='The list of repair objects is not filled. Calculation failed!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Элементы.РегламентныеМероприятия.ТекущиеДанные.НормативныйРемонт )
			ИЛИ НЕ ЗначениеЗаполнено(Элементы.РегламентныеМероприятия.ТекущиеДанные.ВидМероприятия) Тогда
			
			ТекстСообщения = НСтр("es='¡No todos los campos son rellenados para la medida de reglamento! ¡El cálculo no es cumplido!';ru='Не все поля заполнены для регламентного мероприятия! Расчет не выполнен!';en='Not all fields are filled out for a scheduled event! Calculation failed!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ПродолжительностьРемонта = ПерерассчитатьНаСервере(Объект.ИндивидуальноеОбслуживаниеОР,
		                           МассивОР, 
								   Элементы.РегламентныеМероприятия.ТекущиеДанные.НормативныйРемонт, 
								   Элементы.РегламентныеМероприятия.ТекущиеДанные.ВидМероприятия,
		                           КоличествоОР);
		Элементы.РегламентныеМероприятия.ТекущиеДанные.Продолжительность = ПродолжительностьРемонта;
		МодифицированностьРегМер = Истина;
		Модифицированность = Истина;
		ОбновитьОтображениеПродолжительности();
		
	ИначеЕсли Элементы.РегламентныеМероприятия.ТекущиеДанные.СпособРасчетаПродолжительности = ПредопределенноеЗначение("Перечисление.торо_СпособыРасчетаПродолжительности.ПроизвольноеЗначение") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РасчитатьЗавершение", ЭтаФорма, );
		ФормаПодбораПродолжительности = ОткрытьФорму ("ОбщаяФорма.торо_ФормаПодбораПродолжительности", ,,Объект.Ссылка,,,ОписаниеОповещения);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыходныеДокументы

&НаКлиенте
Процедура ВыходныеДокументыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
	
		ТекДанныеРегМероприятий = Элементы.РегламентныеМероприятия.ТекущиеДанные;
		Если ТекДанныеРегМероприятий <> Неопределено Тогда
		    ТекСтрока = Элемент.ТекущиеДанные;
			ТекСтрока.ВидМероприятия = ТекДанныеРегМероприятий.ВидМероприятия;
		    ТекСтрока.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеДокументыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	ТекущДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
	Если НЕ ОтменаРедактирования И НЕ ТекДанные = Неопределено И НЕ ТекущДанные = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.ВыходнойДокумент) Тогда
			ТекстСообщения = НСтр("es='el documento de salida!';ru='Не заполнен выходной документ!';en='The output document is not filled out!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		
		МассивСтрок = ВыходныеДокументы.НайтиСтроки(Новый Структура("СписокОбъектов, ВидМероприятия, ВыходнойДокумент", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент), ТекущДанные.ВидМероприятия, ТекДанные.ВыходнойДокумент));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡No es posible introducir los documentos de salida que repeten!';ru='Нельзя вводить повторяющиеся выходные документы!';en='Can not enter duplicate output!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		МодифицированностьВыхДок = Истина;
		
		Если НоваяСтрока Тогда 
			ТекДанные.ВидМероприятия = ТекущДанные.ВидМероприятия;
			ТекДанные.СписокОбъектов = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, СсылкаНаЭлемент);
			Элементы.ВыходныеДокументы.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидМероприятия, СписокОбъектов", ТекущДанные.ВидМероприятия, ТекущДанные.СписокОбъектов);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредстоящиеМероприятия

&НаКлиенте
Процедура ПредстоящиеМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыполненныеМероприятия

&НаКлиенте
Процедура ВыполненныеМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Перерассчитать(Команда)
	
	СпособРасчетаПродолжительностиПриИзменении(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьЗавершение(Результат, ДополнительныеПараметры)Экспорт
	Если ТипЗнч(Результат) = Тип("Число") Тогда
		МодифицированностьРегМер = Истина;
		Модифицированность = Истина;
		Элементы.РегламентныеМероприятия.ТекущиеДанные.Продолжительность = Результат;
		ОбновитьОтображениеПродолжительности();
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеАкты(Команда)
	
	Кнопка = Элементы.ВыполненныеМероприятияОтображатьТолькоПроведенныеАкты;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеГрафикиРМ(Команда)
	
	Кнопка = Элементы.ПредстоящиеМероприятияОтображатьТолькоПроведенныеГрафикиРМ;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПодборОР(Команда)	
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, ИспользоватьВариантУчетаИерархииЭлементов, МножественныйВыбор", Ложь, Истина, Истина);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", ПараметрыФормы, Элементы.СписокОбъектов, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПерерассчитатьНаСервере(ИндивидОбслуживаниеОР, МассивОР, ТекНормРемонт, ТекВидМероприятия, КолОР)
	
	Если ИндивидОбслуживаниеОР Тогда
		ТаблицаОбъектов = Новый ТаблицаЗначений;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.торо_ОбъектыРемонта"));
		ТипКолонки = Новый ОписаниеТипов(МассивТипов);
		ТаблицаОбъектов.Колонки.Добавить("ОбъектРемонта", ТипКолонки);
		Для каждого Элем Из МассивОР Цикл
		
			ТаблицаОбъектов.Добавить().ОбъектРемонта = Элем;
		
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбъектов.ОбъектРемонта
		|ПОМЕСТИТЬ ТаблицаОбъектов
		|ИЗ
		|	&ТаблицаОбъектов КАК ТаблицаОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта
		|ПОМЕСТИТЬ СтандартныйРемонт
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаСреза, ИдентификаторТехКарты = &НормРемонт) КАК торо_ВерсииТехКартСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА торо_НормативныеРемонтыОборудования.НормативныйРемонт ЕСТЬ NULL 
		|			ТОГДА &НормРемонт
		|		ИНАЧЕ торо_НормативныеРемонтыОборудования.НормативныйРемонт
		|	КОНЕЦ КАК НормативныйРемонт,
		|	ТаблицаОбъектов.ОбъектРемонта,
		|	ЕСТЬNULL(торо_ВерсииТехКартСрезПоследних.ТехКарта, СтандартныйРемонт.ТехКарта) КАК ТехКарта
		|ПОМЕСТИТЬ НормРем
		|ИЗ
		|	ТаблицаОбъектов КАК ТаблицаОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаСреза) КАК торо_ВерсииТехКартСрезПоследних
		|			ПО торо_НормативныеРемонтыОборудования.НормативныйРемонт = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|		ПО ТаблицаОбъектов.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ОбъектРемонта
		|			И (торо_НормативныеРемонтыОборудования.ВидРемонта = &ВидРемонта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтандартныйРемонт КАК СтандартныйРемонт
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(торо_ТехКарты.НормаВремени) КАК НормаВремени
		|ИЗ
		|	НормРем КАК НормРем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты КАК торо_ТехКарты
		|		ПО НормРем.ТехКарта = торо_ТехКарты.Ссылка";
		
		Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
		Запрос.УстановитьПараметр("НормРемонт", ТекНормРемонт);
		Запрос.УстановитьПараметр("ВидРемонта", ТекВидМероприятия);
		Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.НормаВремени;
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(торо_ТехКарты.НормаВремени) КАК НормаВремени
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаСреза, ИдентификаторТехКарты = &ТехКарта) КАК торо_ВерсииТехКартСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты КАК торо_ТехКарты
		|		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты.Ссылка";
		
		Запрос.УстановитьПараметр("ТехКарта", ТекНормРемонт);
		Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.НормаВремени * КолОР;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеПродолжительности()
	
	Если Элементы.РегламентныеМероприятия.ТекущиеДанные = Неопределено Тогда
		Элементы.Перерассчитать.Доступность = Ложь;
		Элементы.СпособРасчетаПродолжительности.Доступность = Ложь;
		Элементы.НормаВремени.Заголовок = НСтр("es='de la medida';ru='Не выбран вид мероприятия';en='Event type not selected'");
	Иначе
		Элементы.Перерассчитать.Доступность = Истина И ПравоРедактирования;
		Элементы.СпособРасчетаПродолжительности.Доступность = Истина;
		СтроковоеПредставлениеНормы = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Элементы.РегламентныеМероприятия.ТекущиеДанные.Продолжительность);
		Элементы.НормаВремени.Заголовок	= СтроковоеПредставлениеНормы;
		
		Если Элементы.РегламентныеМероприятия.ТекущиеДанные.Продолжительность = 0 Тогда
			Элементы.РегламентныеМероприятия.ТекущиеДанные.СпособРасчетаПродолжительности = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеГрафикаРемРабНаСервере()
	
	Возврат Константы.торо_ГрафикРемонтныхРабот.Получить();
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеОбязательныхПолейНаборовЗаписей(СтрктураОбязательныхПолей, ИмяРеквизита, Отказ, Заголовок)
	
	ТаблицаДляПроверки = ЭтаФорма[ИмяРеквизита].Выгрузить();
	
	ПризнакОшибки = Ложь;
	
	Для Каждого СтрокаНЗ Из ТаблицаДляПроверки Цикл
		
		Для Каждого КлючИЗначение Из СтрктураОбязательныхПолей Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаНЗ[КлючИЗначение.Ключ]) Тогда
				
				Если Не ПризнакОшибки Тогда
					
					ОбщегоНазначения.СообщитьПользователю(Заголовок);
					ПризнакОшибки = Истина;
					
				КонецЕсли;
				
				ШаблонСообщения = НСтр("es='La línea № %1. ¡No es rellenado el significado del requisito ""%2""!';ru='Строка № %1. Не заполнено значение реквизита ""%2""!';en='Line № %1. Requisite value ""%2"" is not filled!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ТаблицаДляПроверки.Индекс(СтрокаНЗ) + 1), КлючИЗначение.Значение);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура СообщитьОВозможномИзмененииПродолжительностиРемонта()
	
	Если Объект.ИндивидуальноеОбслуживаниеОР <> флИндОбслужНачальный Тогда
		ТекстСообщения = НСтр("en='The flag ""Individual service EI"" changed, recalculate the duration of repairs!';es='¡Es cambiada la bandera ""el servicio ОР Individual"", перерассчитайте la duración de las reparaciones!';ru='Изменен флаг ""Индивидуальное обслуживание ОР"", перерассчитайте продолжительность ремонтов!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если флСписокОбъектовМодифицированность Тогда
		ТекстСообщения = НСтр("es='¡Es cambiada la composición de la lista de los objetos de la reparación, перерассчитайте la duración de las reparaciones!';ru='Изменен состав списка объектов ремонта, перерассчитайте продолжительность ремонтов!';en='The list of repair objects has been changed; recalculate the duration of repairs!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если НЕ Объект.ИндивидуальноеОбслуживаниеОР И СписокМодифицированныхМероприятий.Количество() Тогда
		
		Для каждого Элем Из СписокМодифицированныхМероприятий Цикл
			ШаблонСообщения = НСтр("es='¡Es cambiada la composición de la lista de los objetos de la reparación de la medida ""%1"", перерассчитайте la duración de las reparaciones!';ru='Изменен состав списка объектов ремонта мероприятия ""%1"", перерассчитайте продолжительность ремонтов!';en='The list of repair objects for the event ""%1"" changed, recalculate the duration of repairs!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Элем.Значение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаДатыОтсчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	сз = Новый Массив;
	сз.Добавить(ПредопределенноеЗначение(
		"Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.НеИспользоватьДатуВводаВЭксплуатацию"));
	сз.Добавить(ПредопределенноеЗначение(
		"Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуПланированияВКачествеДатыОтсчета"));
	сз.Добавить(ПредопределенноеЗначение(
		"Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоПоследнемуРемонтуИлиДатеПланирования"));

	ПараметрыПолученияДанных.отбор = новый Структура("Ссылка",сз);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоэффициентыРемонтныхОсобенностей()
	
	Перем МассивКоэффициентов;
	
	РассчитываемыеКоэффициенты.Очистить();
	УстанавливаемыеКоэффициенты.Очистить();
	
	МассивКоэффициентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента КАК Ссылка,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ЗначениеКоэффициента,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.Рассчитываемый,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ЗависитОтНаработки,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.СчитатьВозрастОтДатыИзготовления,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьГрафикРаботыОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьПростоиОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ПараметрНаработки
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта И Использование) КАК торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей КАК торо_ВидыКоэффициентовРемонтныхОсобенностей
	|		ПО торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента = торо_ВидыКоэффициентовРемонтныхОсобенностей.Ссылка
	|ГДЕ
	|	НЕ торо_ВидыКоэффициентовРемонтныхОсобенностей.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Рассчитываемый Тогда
					
			НС = РассчитываемыеКоэффициенты.Добавить();
			НС.ВидКоэффициента = Выборка.Ссылка;
			НС.ЗначениеКоэффициента = Выборка.ЗначениеКоэффициента;
			НС.Коэффициент = Выборка.ЗначениеКоэффициента.Коэффициент;
			
			МассивКоэффициентов.Добавить(НС.Коэффициент);			
		Иначе
			НС = УстанавливаемыеКоэффициенты.Добавить();
			НС.ВидКоэффициента = Выборка.Ссылка;
			НС.ЗначениеКоэффициента = Выборка.ЗначениеКоэффициента;
			НС.Коэффициент = Выборка.ЗначениеКоэффициента.Коэффициент;
			
			МассивКоэффициентов.Добавить(НС.Коэффициент);
		КонецЕсли;
	КонецЦикла;
	
	ИтогКоэф = 1;
	Для каждого Элем Из МассивКоэффициентов Цикл
		
		ИтогКоэф = ИтогКоэф * Элем;
		
	КонецЦикла; 
	
	Если НЕ МассивКоэффициентов.Количество() = 0 Тогда
		ИтоговыйКоэффициент = ИтогКоэф;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЗапросовНаСервере()
	
	Кнопка = Элементы.ВыполненныеМероприятияОтображатьТолькоПроведенныеАкты;
	ВыполненныеМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ВыполненныеМероприятия.Параметры.УстановитьЗначениеПараметра("СписокОбъектов", Объект.Ссылка);
	
	Кнопка = Элементы.ПредстоящиеМероприятияОтображатьТолькоПроведенныеГрафикиРМ;
	ПредстоящиеМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ПредстоящиеМероприятия.Параметры.УстановитьЗначениеПараметра("СписокОбъектов", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияСпособПланированияПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияВидМероприятияПриИзменении(Элемент)
	МодифицированностьРегМер = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияСпособПланированияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбора = Новый Структура("ИспользоватьПериодичность, ИспользоватьПараметрыНаработки", Истина, Ложь);
	ПараметрыПолученияДанных.Вставить("Отбор", СтруктураОтбора);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");

КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [23.10.2019]
&НаСервере
Процедура дс_УстановитьЗаголовкиЭлементов()
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить("ВыполненныеМероприятияДатаНачалаПлан", 		НСтр("es='Fecha de inicio del plan de';ru='Дата начала план';en='Plan start date'"));
	Заголовки.Вставить("ВыполненныеМероприятияДатаНачалаФакт", 		НСтр("es='Fecha de inicio del hecho';ru='Дата начала факт';en='Start date fact'"));
	Заголовки.Вставить("ВыполненныеМероприятияДатаОкончанияПлан", 	НСтр("es='La fecha de finalización de un plan de';ru='Дата окончания план';en='Plan end date'"));
	Заголовки.Вставить("ВыполненныеМероприятияДатаОкончанияФакт", 	НСтр("es='La fecha de finalización de hecho';ru='Дата окончания факт';en='End date fact'"));

	Для каждого ЗаголовокЭлемента Из Заголовки Цикл
		ИмяЭлемента = ЗаголовокЭлемента.Ключ;
		ПереводЗаголовка = ЗаголовокЭлемента.Значение;
		
		Элементы[ИмяЭлемента].Заголовок = ПереводЗаголовка;
	КонецЦикла; 
КонецПроцедуры 
// << [Деснол] [Ушаков А.Д.] [23.10.2019]

СписокОбъектовДобавляется = Ложь;
РегламентноеМероприятиеДобавляется = Ложь;
ВыходныеДокументыДобавляется = Ложь;
#КонецОбласти
